class Categories {
  Map<String, List<String>> allCategory = {
    'หมวดหมู่ทั้งหมด': ['หมวดหมู่รองทั้งหมด'],
    'เสื้อผ้าชาย': [
      'เสื้อ',
      'กางเกง',
      'ส่วมใส่เท้า',
      'เข็มขัด',
      'เครื่องประดับ',
      'หมวก',
    ],
    'เสื้อผ้าหญิง': [
      'เสื้อ',
      'กระโปรง',
      'ส่วมใส่เท้า',
      'กางเกง',
      'เครื่องประดับ',
      'เข็มขัด'
    ],
    'เครื่องใช้ไฟฟ้าภายในบ้าน': [
      'ห้องครัว',
      'ห้องน้ำ',
      'ห้องนั่งเล่น',
      'ห้องนอน'
    ],
    'เครื่องใช้ภายในบ้าน': ['ห้องครัว', 'ห้องน้ำ', 'ห้องนั่งเล่น', 'ห้องนอน'],
    'อุปกรณ์กีฬาและกิจกรรมกลางแจ้ง': [
      'อุปกรณ์กีฬา',
      'เครื่องออกกำลังกาย',
      'อุปกรณ์ปิกนิกและเดินป่า'
    ],
    'สื่อการเรียนรู้และงานอดิเรก': ['หนังสือ', 'สารคดี', 'เครื่องดนตรี'],
  };
}
